Repository: OmegaT-L10N/ca
Catalog: tm/auto/CO-CA1.tmx
Source language: en
Languages: ca

source: 1.1. Search options
ca: 1.1. Opcions de cerca

source: 1. Shortcuts customization
ca: 1. Personalització de dreceres

source: 1. OmegaT sites and OmegaT SourceForge project
ca: Llocs web d'OmegaT i projecte d'OmegaT a SourceForge

source: 1. Introduction
ca: 1. Introducció

source: 1. Search window
ca: 1. Finestra de cerca

source: 2. Bug reports
ca: 2. Informes d'errors

source: 2. Installation and Use
ca: 2. Instal·lació i ús

source: 2. Project Menu
ca: 2. Menú Projecte

source: 2. Use
ca: 2. Ús

source: 2. User settings files
ca: 2. Fitxers de configuració de l'usuari

source: 3.2. Search window
ca: 3.2. Finestra de cerca

source: 3. Contributing to OmegaT project
ca: 3. Col·laboració en el projecte d'OmegaT

source: 3. Edit Menu
ca: 3. Menú Edita

source: 3. Scripting languages
ca: 3. Els llenguatges script

source: 4. GoTo Menu
ca: 4. Menú Vés a

source: 5. View Menu
ca: 5. Menú visualització

source: 6. Tools Menu
ca: 6. Menú Eines

source: 7. Options Menu
ca: 7. Menú Opcions

source: 8. Help Menu
ca: 8. Menú Ajuda

source: [2] The full syntax for keystrokes (shortcuts) is defined in the following Java 1.6 documentation from Oracle (bottom of page): Java 1.6 keystrokes shortcuts
ca: [2] La sintaxi completa de pulsacions (dreceres) es defineix en la següent documentació de Java 1.6 a Oracle (part inferior de la pàgina): Dreceres de pulsacions de teclat de Java 1.6

source: [3] On the Mac, the modifier meta must be used to specify the command key.
ca: [3] En Mac, el modificador meta s'ha d'utilitzar per especificar la tecla command.

source: [4] The possible keyevents (keys) are listed in the following Java 1.6 documentation from Oracle: Java 1.6 keyEvents description
ca: [4] Els possibles keyevents (tecles) s'enumeren en la següent documentació de Java 1.6 a Oracle: Descripció de keyevents Java 1.6

source: [5] The default OmegaT shortcuts are available from Sourceforge: Default OmegaT Shortcuts
ca: [5] Les dreceres per defecte d'OmegaT estan disponibles a Sourceforge:: Dreceres per defecte d'OmegaT

source: LanguageTool is an Open Source style and grammar proofreading software for English, French, German, Polish, Dutch, Romanian, and a number of other languages - see the list of supported languages.
ca: LanguageTool és un programari de codi obert i correcció gramatical per anglès, francès, alemany, polonès, holandès, romanès, i altres idiomes - vegeu la llista d'idiomes admesos.

source: Prev
ca: Anterior

source: <event> can be: typed, pressed, released
ca: <event> pot ser: teclejeu, manteniu premut, deixeu anar

source: <modifier> can be: shift, control, ctrl, meta[3], alt, altGraph
ca: <modifier> pot ser: shift, control, ctrl, meta[3], alt, altGraph

source: projectOpenMenuItem=shift ctrl O.
ca: Si voleu utilitzar Shift+Ctrl+O per obrir un projecte, modifiqui el seu arxiu MainMenuShortcuts.properties de la següent manera:

source: Close: close the window without any change.
ca: Tanca: tanca la finestra sense fer cap canvi.

source: Ctrl+N or Enter or Tab
ca: Ctrl+N o Intro o Tab

source: Ctrl+P or Ctrl+Enter or Ctrl+Tab
ca: Ctrl+P o Ctrl+Enter o Ctrl+Tab

source: Groovy (http://groovy.codehaus.org): is a dynamic language for the Java Virtual machine.
ca: Groovy (http://groovy.codehaus.org): és un llenguatge dinàmic per a la màquina virtual Java.

source: JavaScript (sometimes abbreviated JS, not to be confused with Java): is a prototype-based scripting language that is dynamic, weakly typed and has first-class functions.
ca: JavaScript (de vegades abreujat JS, que no s'ha de confondre amb Java): és un llenguatge script basat en prototips dinàmic, de tipus feble i amb funcions de primera classe.

source: Replace All: operates replacement of all occurrences (after displaying a confirmation window where the number of occurrences is shown).
ca: Replace All (substitueix-ho tot): realitza la substitució de tots els resultats (després de mostrar una finestra de confirmació que indica el nombre de resultats).

source: Replace: operates a "one by one" replacement, by the mean of buttons in the header of the Editor pane.
ca: Replace (substitueix): realitza una substitució "un a un", mitjançant els botons de la capçalera del panell Editor.

source: OmegaT sites and OmegaT SourceForge project
ca: Llocs web d''OmegaT i projecte d'OmegaT a SourceForge

source: <shortcut> must be of the following form: 0 or more <modifier> followed by 0 or 1 <event> followed by 1 <key>, where:
ca: <drecera> ha de ser de la següent manera: 0 o més <modifier> seguit de 0 o 1 <event> seguit d'1 <key>, on:

source: About...
ca: Quant a...

source: All the languages have access to the OmegaT object model, with the project as the top object.
ca: Totes les llengües tenen accés al model d'objectes OmegaT, amb el projecte com a objecte superior.

source: Always Confirm Quit
ca: Confirma sempre en sortir

source: Anything after the "//" will be ignored.
ca: Qualsevol cosa després de la "//" serà ignorada.

source: Appendix D. Tokenizers
ca: Apèndix D. Tokenizers

source: Appendix E. LanguageTool plugin
ca: Apèndix E. Connector LanguageTool

source: Appendix F. Scripts
ca: Apèndix F. Scripts

source: Appendix G. OmegaT on the web
ca: Apèndix G. OmegaT al web

source: Appendix H. Shortcuts customization
ca: Apèndix H. Personalització de dreceres.

source: Appendix I. Legal notices
ca: Apèndix I. Avisos legals

source: Auto-completion/Auto-text...
ca: Emplenament automàtic/Text automàtic...

source: Auto-completion/Character Table...
ca: Emplenament automàtic/Taula de caràcters...

source: Auto-completion/Glossary...
ca: Emplenament automàtic/Glossari...

source: Back in history...
ca: Enrere en l'historial

source: Being the language behind popular software such as Firefox it is a familiar and preferred programming tool in the open-source domain.
ca: És el llenguatge que hi ha darrere de programaris populars com Firefox i una eina de programació coneguda i preferida en el domini de codi obert.

source: Bug reports
ca: Informes d'errors

source: By default, scripts are stored in the "scripts" folder located in OmegaT installation folder (the folder that contains the OmegaT.jar).
ca: Per defecte, els scripts s'emmagatzemen a la carpeta "scripts", ubicada a la carpeta d'instal·lació d'OmegaT (la carpeta que conté OmegaT.jar).

source: Chapter 15. Searches
ca: Capítol 15. Cerques

source: Chapter 16. Search and Replace
ca: Capítol 16. Cerca i substitueix

source: Chapter 17. Regular expressions
ca: Capítol 17. Expressions regulars

source: Click Replace Next or Skip, then end the replacement session with Finish.
ca: Feu clic a Replace next (substitueix següent) o a Skip (omet) i acabeu el procés de substitució amb Finish (finalitza).

source: Clicking Tools > Scripting opens the Scripting window:
ca: En fer clic a Eines> Scripts s'obre la finestra de Scripts:

source: Close
ca: Tanca

source: Contributing to OmegaT project
ca: Col·laboració en el projecte d'OmegaT

source: Create Alternative Translation
ca: Crea una traducció alternativa

source: Create Current Translated Documents
ca: Crea els documents traduïts en ús

source: Create Glossary Entry
ca: Crea una entrada del glossari

source: Create Translated Documents
ca: Crea els documents traduïts

source: Cycle Case To...
ca: Operació de majúscules i minúscules a...

source: Default shortcut
ca: Drecera per defecte

source: Display Source Segments
ca: Mostra els segments de partida

source: Download Team Project
ca: Baixa un projecte en equip...

source: Edit Menu
ca: Menú Edita

source: Editing Behavior...
ca: Comportament de l'edició...

source: Empty lines are accepted and comment lines should start with "//".
ca: Les línies buides hi són acceptades i les línies de comentari han de començar amb "//".

source: Enter the new word or phrase (regular expressions are not supported) in the Replace with box, then click one of the following options:
ca: Introduïu la paraula o frase (no funciona amb expressions regulars) en el quadre Replace with (Substitueix amb) i feu clic en una de les següents opcions:

source: Except one: check Untranslated in order to operate Search and replace also on segments that have not been translated yet.
ca: Llevat d'una: feu clic a Untranslated per activar Cerca i substitueix en els segments que encara no han estat traduïts.

source: Export Selection
ca: Exporta la selecció

source: External TMXs...
ca: Memòries TMX externes...

source: Figure E.1. The LanguageTool in OmegaT
ca: Figura E.1. LanguageTool en OmegaT

source: File Filters...
ca: Filtres de fitxers...

source: Font...
ca: Tipus de lletra...

source: For example, in the default OmegaT shortcuts[5], one can find:
ca: Per exemple, en les dreceres per defecte d'OmegaT [5], es pot trobar:

source: For the latest version of OmegaT, refer to the downloads page at www.omegat.org.
ca: Per obtenir l'última versió d'OmegaT, vegeu la pàgina de baixades a www.omegat.org.

source: Forward in history...
ca: Endavant en l'historial

source: GoTo Menu
ca: Menú Vés a

source: Help Menu
ca: Menú Ajuda

source: Home
ca: Inici

source: If no replacement is done to a given segment, the target segment will be “emptied”, i.e., it will remain untranslated.
ca: Si no es fa cap substitució en un segment determinat, el segment d'arribada es "buidarà", és a dir, es mantindrà sense traduir.

source: If they do not conflict with system shortcuts, they should be available from within OmegaT.
ca: Si no entren en conflicte amb les dreceres del sistema, han d'estar disponibles dins d'OmegaT.

source: If you are on a Mac and you want to add a Shift+Command+S shortcut to Tools → Statistics, add the following line to your MainMenuShortcuts.properties:
ca: Si esteu en un Mac i voleu afegir una drecera Shift+Command+S a Eines → Estadístiques, afegiu la següent línia al seu arxiu MainMenuShortcuts.properties:

source: If you want to use Shift+Ctrl+O to open a project, modify your MainMenuShortcuts.properties as follows:
ca: Si voleu utilitzar Shift+Ctrl+O per obrir un projecte, modifiqui el seu arxiu MainMenuShortcuts.properties de la següent manera:

source: If you wish to keep track of what is happening to the report, register as a SourceForge user, login and file a bug report or simply click Monitor at the top of the report.
ca: Si voleu fer el seguiment de l'informe, cal que us registreu com a usuari de SourceForge, inicieu la sessió i envieu l'informe d'error, o bé simplement feu clic al botó Monitor (Supervisa) de la part superior de l'informe.

source: If you would like to help support the continued development of OmegaT, it would be very much appreciated - click on this link to go to the OmegaT PayPal account.
ca: Si volguéssiu ajudar al continu desenvolupament d'OmegaT, us ho agrairíem molt - feu clic en aquest enllaç per anar al compte PayPal d'OmegaT.

source: Import From MediaWiki...
ca: Importa des de MediaWiki...

source: Import Source Files...
ca: Importa fitxers de partida...

source: In the above example, two scripts (position 1 and 2) have already been added.
ca: En l'exemple anterior ja s'han agregat dos scripts (posició 1 i 2).

source: Incompatibilities
ca: Incompatibilitats

source: Insert Match
ca: Insereix la coincidència

source: Insert Next Missing Tag
ca: Insereix la següent etiqueta que falta

source: Insert Source
ca: Insereix el text de partida

source: Insert Source Tags
ca: Insereix les etiquetes del text de partida

source: Installation and Use
ca: 2. Instal·lació i ús

source: Introduction
ca: Introducció

source: It builds upon the strengths of Java but has additional power features inspired by languages like Python, Ruby and Smalltalk.
ca: Es basa en els punts forts de Java, però té característiques de potència addicionals inspirades en llenguatges com Python, Ruby i Smalltalk.

source: It can also detect some grammar mistakes.
ca: Pot també detectar alguns errors gramaticals.

source: It does not include spell checking.
ca: No inclou la correcció ortogràfica.

source: It is a multi-paradigm language, supporting object-oriented, imperative, and functional programming styles.
ca: És un llenguatge multiparadigma que admet estils de programació funcionals, imperatius i orientats a l'objecte.

source: It will be used automatically by OmegaT if Options > Language Checker is checked.
ca: Serà aplicat automàticament per OmegaT si feu clic en Opcions> Verificador lingüístic.

source: LanguageTool will find errors for which a rule has been defined in its language-specific configuration files.
ca: LanguageTool trobarà errors per als quals s'ha definit una regla general en els seus fitxers de configuració específics de l'idioma.

source: LanguageTool will not work properly if an old version is found in the /plugin folder.
ca: LanguageTool no funcionarà correctament si una versió antiga es troba a la carpeta /plugin.

source: Last Changes...
ca: Darrers Canvis...

source: Load a script into the editor by clicking on its name in the list on the left panel.
ca: Carregueu un script en l'editor fent clic en el seu nom, en la llista del panell esquerre.

source: Log...
ca: Registre...

source: Machine Translate
ca: Traducció automàtica

source: Mark Bidirectional Algorithm Control Characters
ca: Marca els caràcters de control d'algorisme bidireccional

source: Mark Non-Unique Segments
ca: Marca els segments no únics

source: Mark Non-breakable Spaces
ca: Marca els espais no separables

source: Mark Segments with Notes
ca: Marca els segments amb notes

source: Mark Translated Segments
ca: Marca els segments traduïts

source: Mark Untranslated Segments
ca: Marca els segments no traduïts

source: Mark Whitespace
ca: Marca els espais en blanc

source: Match Statistics
ca: Estadístiques de coincidències

source: Match Statistics per File
ca: Estadístiques de coincidències per fitxer

source: Menu Item
ca: Element de menú

source: Menu Item Code
ca: Codi d'element de menú

source: Modification Info/Display All
ca: Informació de modificació/Mostra-la en tots els segments

source: Modification Info/Display None
ca: Informació de modificació/No la mostris

source: Modification Info/Display Selected
ca: Informació de modificació/Mostra-la al segment actual

source: More can be found in the Painless Bug Tracking article by Joel Spolsky.
ca: Podeu trobar més informació a l'article Painless Bug Tracking d'en Joel Spolsky

source: Most of the items that appear in the main menu can have a new shortcut assigned.
ca: La majoria dels elements que apareixen al menú principal poden tenir una nova drecera assignada.

source: Navigation footer
ca: Peu de pàgina de navegació

source: Navigation header
ca: Capçalera de navegació

source: New
ca: Nou

source: Next
ca: Següent

source: Next Note
ca: Nota següent

source: Next Segment
ca: Segment següent

source: Next Translated Segment
ca: Segment següent traduït

source: Next Untranslated Segment
ca: Segment següent sense traduir

source: Note that bug reports and requests for enhancements are publicly visible, so you should not add any sensitive files.
ca: Tingueu en compte que els informes d'errors i les sol·licituds de millora són públics; per tant, no hi afegiu cap fitxer que contingui informació confidencial.

source: OmegaT 3.1 - User's Guide
ca: OmegaT 3.1 - Manual d'usuari

source: OmegaT allows to run scripts written in different scripting languages.
ca: OmegaT permet executar scripts escrits en diferents llenguatges script.

source: Once the MainMenuShortcuts.properties file is modified, OmegaT must be relaunched to take the new shortcuts into account.
ca: Una vegada que l'arxiu MainMenuShortcuts.properties es modifica, OmegaT ha de ser rellançat perquè tingui les noves dreceres en compte.

source: Open
ca: Obre

source: Open the Search and replace window with Ctrl+K and enter the word or expression you wish to replace in the Search for box.
ca: Obriu la finestra Cerca i substitueix amb Ctrl+K i escriviu la paraula o frase que voleu canviar en el quadre Cerca.

source: Options Menu
ca: Menú Opcions

source: Previous Note
ca: Nota anterior

source: Previous Segment
ca: Segment anterior

source: Project Files...
ca: Fitxers del projecte...

source: Project Menu
ca: Menú Projecte

source: Properties...
ca: Propietats …

source: Proxy Login...
ca: Inici de sessió al servidor intermediari...

source: Quit
ca: Surt

source: Redo Last Action
ca: Refés l'última acció

source: Register Identical Translation
ca: Registra una traducció idèntica

source: Reload
ca: Torna a carregar

source: Remember that every good bug report needs just three things:
ca: Tingueu en compte que, per a crear un informe d'error que sigui realment útil, cal que hi especifiqueu solament aquestes tres coses:

source: Remove LanguageTool from the /plugin folder before starting OmegaT.
ca: Traieu LanguageTool de la carpeta /plugin abans d'executar OmegaT.

source: Replace With Match
ca: Reemplaça per la coincidència

source: Replace With Source
ca: Reemplaça pel text de partida

source: Replace with Machine Translation
ca: Reemplaça amb la traducció automàtica

source: Restore Main Window
ca: Restaura la finestra principal

source: Right-click on a button from "<1>" to "<12>" in the bottom panel and select "Add".
ca: Feu clic amb el botó dret en una opció de l'"<1>" al "<12>" al panell inferior i seleccioneu "Afegir".

source: Save
ca: Desa

source: Save then the file and relaunch OmegaT.
ca: Deseu el fitxer i després rellanceu OmegaT.

source: Saving and Output...
ca: Desament i sortida...

source: Scripting languages
ca: Els llenguatges script

source: Search Project...
ca: Cerca al projecte...

source: Search and Replace...
ca: Cerca i reemplaça

source: Search options
ca: Opcions de cerca

source: Search options are similar to the ones displayed in Search window.
ca: Les opcions de cerca són similars a les que es mostren en la Finestra de cerca.

source: Search window
ca: Finestra de cerca

source: Segment number...
ca: Número de segment...

source: Segmentation...
ca: Segmentació...

source: Select Fuzzy Match 1
ca: Selecciona la coincidència núm. 1

source: Select Fuzzy Match 2
ca: Selecciona la coincidència núm. 2

source: Select Fuzzy Match 3
ca: Selecciona la coincidència núm. 3

source: Select Fuzzy Match 4
ca: Selecciona la coincidència núm. 4

source: Select Fuzzy Match 5
ca: Selecciona la coincidència núm. 5

source: Select Next Match
ca: Selecciona la coincidència següent

source: Select Previous Match
ca: Selecciona la coincidència anterior

source: Shortcuts customization
ca: Personalització de dreceres.

source: Spell checking...
ca: Verificació ortogràfica...

source: Statistics
ca: Estadístiques

source: Steps to reproduce
ca: Els passos per a reproduir l'error

source: Switch Case To/Lower Case
ca: Canvia majúscules i minúscules a /Minúscules

source: Switch Case To/Title Case
ca: Canvia majúscules i minúscules a/ Lletra majúscula inicial

source: Switch Case To/Upper Case
ca: Canvia majúscules i minúscules a/ Majúscules

source: Table H.1. Project Menu
ca: Taula H.1. Menú Projecte

source: Table H.2. Edit Menu
ca: Taula H.2. Menú Edita

source: Table H.3. GoTo Menu
ca: Taula H.3. Menú Vés a

source: Table H.4. View Menu
ca: Taula H.2. Menú Visualització

source: Table H.5. Tools Menu
ca: Taula H.1. Menú Eines

source: Table H.6. Options Menu
ca: Taula H.6. Menú Opcions

source: Table H.7. Help Menu
ca: Taula H.7. Menú Ajuda

source: Tag Validation...
ca: Validació de les etiquetes...

source: Team...
ca: Equip...

source: The FAQ is a good starting point for finding answers to questions you may have.
ca: L'apartat de PMF és un bon punt de partida per trobar respostes a les preguntes que pugueu tenir.

source: The LanguageTool in OmegaT
ca: LanguageTool en OmegaT

source: The LanguageTool plugin is included in OmegaT.
ca: El connector LanguageTool està inclòs en OmegaT.

source: The Scripting window allows you to load an existing script into the text area and run it against the current opened project.
ca: La finestra de Scripts us permetrà carregar un script existent en l'àrea de text i executar-lo en el projecte obert en ús.

source: The default OmegaT shortcuts for the Mac are also available from Sourceforge, they all use "meta" instead of "ctrl": Default OmegaT Shortcuts for the Mac
ca: Les dreceres per defecte d'OmegaT per a Mac també estan disponibles a Sourceforge: totes elles utilitzen "meta" en lloc de "ctrl": Dreceres per defecte d'OmegaT per a Mac

source: The first is the shortcut for Open Project, the second for Create Glossary Entry.
ca: La primera és la drecera per Obre projecte, la segona per Crea una entrada del glossari.

source: The following code snippet in groovy for instance scans through all the segments in all files in the current project and, if the translation exists, prints out the source and the target of the segment:
ca: El següent codi snippet en Groovy, per exemple, explora a través de tots els segments de tots els arxius del projecte en ús i, si existeix una traducció, n'imprimeix l'original i la traducció del segment:

source: The following scripting languages have been implemented:
ca: Els següents llenguatges script s'han implementat:

source: The rules applied (if any) will depend on the source and target language of the project.
ca: Les normes aplicades (si n'hi ha) dependran de la llengua de partida i d'arribada del projecte.

source: The shortcut definition file must be named MainMenuShortcuts.properties and must contain at most one shortcut definition per line.
ca: L'arxiu de definició de drecera ha de ser nomenat MainMenuShortcuts.properties i ha de contenir com a màxim una definició de drecera per línia.

source: The shortcut definition syntax is the following: <menu item code>=<shortcut>, where <menu item code> is a code taken from the tables below and <shortcut> is a combination of pressed keys specified by the user[2].
ca: La sintaxi de definició de drecera és la següent: <codi d'element de menú>=<drecera>, on <codi d'element de menú> és un codi pres de les taules de baix i <drecera> és una combinació de tecles especificades per l'usuari[2].

source: The OmegaT web site contains links to numerous OmegaT resources.
ca: El lloc web d'OmegaT conté enllaços amb diversos recursos d'OmegaT.

source: Then click on Search button to display all the corresponding occurrences.
ca: Després feu clic al botó Cerca per mostrar tots els resultats corresponents.

source: To contribute to OmegaT:
ca: Per contribuir a OmegaT:

source: To customize the script feature, do the following:
ca: Per personalitzar la funció de script, feu el següent:

source: To get involved in the OmegaT development effort you can join the developer group, via the web or by sending an email to omegat-development-request@lists.sourceforge.net with "subscribe" as the subject line.
ca: Per participar en l'esforç de desenvolupament d'OmegaT podeu unir-vos al grup de desenvolupadors, a través del web o mitjançant un correu electrònic a omegat-development-request@lists.sourceforge.net amb "subscribe" en l'assumpte.

source: To make it possible (although Search and replace operates only on memory), OmegaT will copy the source segment to the target segment before the replace operation occurs.
ca: Perquè sigui possible (encara que Cerca i substitueix funciona només en la memòria), OmegaT copiarà el segment de partida al segment d'arribada abans que realitzi l'operació de substitució.

source: To support the OmegaT project financially
ca: Per donar suport econòmic al projecte d'OmegaT

source: To translate OmegaT's user interface, user manual or other related documents:
ca: Per traduir la interfície d'usuari, el manual d'usuari o altres documents d'OmegaT relacionats:

source: Tools Menu
ca: Menú Eines

source: TransTips/Enable Transtips
ca: Suggeriments de traducció/Habilita els suggeriments de traducció
